## Terraform Plan for Staging Environment

**Environment**: Staging
**Workspace**: staging
**Branch**: develop
**Triggered by**: PR #114
  
  <details><summary>Click to expand plan</summary>
  
  ```hcl
  
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.database.aws_db_instance.database must be replaced
+/- resource "aws_db_instance" "database" {
      ~ address                               = "staging-db.c38ukeqk0mqb.us-east-2.rds.amazonaws.com" -> (known after apply)
      ~ arn                                   = "arn:aws:rds:us-east-2:123324351829:db:staging-db" -> (known after apply)
      ~ availability_zone                     = "us-east-2a" -> (known after apply)
      ~ backup_target                         = "region" -> (known after apply)
      ~ ca_cert_identifier                    = "rds-ca-rsa2048-g1" -> (known after apply)
      + character_set_name                    = (known after apply)
      - customer_owned_ip_enabled             = false -> null
      ~ database_insights_mode                = "standard" -> (known after apply)
      - domain_dns_ips                        = [] -> null
      + domain_fqdn                           = (known after apply)
      - enabled_cloudwatch_logs_exports       = [] -> null
      ~ endpoint                              = "staging-db.c38ukeqk0mqb.us-east-2.rds.amazonaws.com:3306" -> (known after apply)
      ~ engine                                = "mysql" -> "postgres" # forces replacement
      ~ engine_lifecycle_support              = "open-source-rds-extended-support" -> (known after apply)
      ~ engine_version                        = "8.0" -> "15.4"
      ~ engine_version_actual                 = "8.0.41" -> (known after apply)
      ~ hosted_zone_id                        = "Z2XHWR1WZ565X2" -> (known after apply)
      - iam_database_authentication_enabled   = false -> null
      ~ id                                    = "db-SV5HXYS2DQJHNT3RGZGXM6WMXY" -> (known after apply)
      + identifier_prefix                     = (known after apply)
      ~ kms_key_id                            = "arn:aws:kms:us-east-2:123324351829:key/abb08b13-20f5-4c44-9964-ca60e4c2798c" -> (known after apply)
      ~ latest_restorable_time                = "2025-07-29T21:25:00Z" -> (known after apply)
      ~ license_model                         = "general-public-license" -> (known after apply)
      ~ listener_endpoint                     = [] -> (known after apply)
      ~ master_user_secret                    = [] -> (known after apply)
      + master_user_secret_kms_key_id         = (known after apply)
      ~ max_allocated_storage                 = 0 -> 100
      ~ monitoring_interval                   = 0 -> 60
      + monitoring_role_arn                   = (known after apply)
      + nchar_character_set_name              = (known after apply)
      ~ network_type                          = "IPV4" -> (known after apply)
      ~ option_group_name                     = "default:mysql-8-0" -> (known after apply)
      ~ parameter_group_name                  = "default.mysql8.0" -> "staging-db-params"
      ~ performance_insights_enabled          = false -> true
      + performance_insights_kms_key_id       = (known after apply)
      ~ performance_insights_retention_period = 0 -> 7
      ~ port                                  = 3306 -> (known after apply)
      + replica_mode                          = (known after apply)
      ~ replicas                              = [] -> (known after apply)
      ~ resource_id                           = "db-SV5HXYS2DQJHNT3RGZGXM6WMXY" -> (known after apply)
      + snapshot_identifier                   = (known after apply)
      ~ status                                = "available" -> (known after apply)
        tags                                  = {
            "Name" = "staging-database"
        }
      + timezone                              = (known after apply)
        # (32 unchanged attributes hidden)
    }

  # module.database.aws_db_parameter_group.database will be created
  + resource "aws_db_parameter_group" "database" {
      + arn          = (known after apply)
      + description  = "Managed by Terraform"
      + family       = "postgres15"
      + id           = (known after apply)
      + name         = "staging-db-params"
      + name_prefix  = (known after apply)
      + skip_destroy = false
      + tags         = {
          + "Name" = "staging-db-params"
        }
      + tags_all     = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Name"        = "staging-db-params"
          + "Pipeline"    = "gitflow-cicd"
          + "Project"     = "tf-playground"
          + "Tier"        = "staging"
        }

      + parameter {
          + apply_method = "immediate"
          + name         = "checkpoint_completion_target"
          + value        = "0.9"
        }
      + parameter {
          + apply_method = "immediate"
          + name         = "effective_cache_size"
          + value        = "524288"
        }
      + parameter {
          + apply_method = "immediate"
          + name         = "maintenance_work_mem"
          + value        = "65536"
        }
      + parameter {
          + apply_method = "immediate"
          + name         = "max_connections"
          + value        = "200"
        }
      + parameter {
          + apply_method = "immediate"
          + name         = "random_page_cost"
          + value        = "1.1"
        }
      + parameter {
          + apply_method = "immediate"
          + name         = "shared_preload_libraries"
          + value        = "pg_stat_statements"
        }
      + parameter {
          + apply_method = "immediate"
          + name         = "wal_buffers"
          + value        = "2048"
        }
      + parameter {
          + apply_method = "immediate"
          + name         = "work_mem"
          + value        = "4096"
        }
    }

  # module.database.aws_iam_role.rds_enhanced_monitoring will be created
  + resource "aws_iam_role" "rds_enhanced_monitoring" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "monitoring.rds.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "staging-rds-enhanced-monitoring"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Name" = "staging-rds-enhanced-monitoring"
        }
      + tags_all              = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Name"        = "staging-rds-enhanced-monitoring"
          + "Pipeline"    = "gitflow-cicd"
          + "Project"     = "tf-playground"
          + "Tier"        = "staging"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.database.aws_iam_role_policy_attachment.rds_enhanced_monitoring will be created
  + resource "aws_iam_role_policy_attachment" "rds_enhanced_monitoring" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonRDSEnhancedMonitoringRole"
      + role       = "staging-rds-enhanced-monitoring"
    }

  # module.database.aws_security_group_rule.database_ecs_ingress[0] must be replaced
-/+ resource "aws_security_group_rule" "database_ecs_ingress" {
      ~ description              = "Allow ECS tasks to access database on port 3306" -> "Allow ECS tasks to access PostgreSQL database on port 5432"
      ~ from_port                = 3306 -> 5432 # forces replacement
      ~ id                       = "sgrule-1103015390" -> (known after apply)
      ~ security_group_rule_id   = "sgr-0487b32fe46d7f9a8" -> (known after apply)
      ~ to_port                  = 3306 -> 5432 # forces replacement
        # (5 unchanged attributes hidden)
    }

  # module.ecs[0].aws_ecs_service.blue will be updated in-place
  ~ resource "aws_ecs_service" "blue" {
        id                                 = "arn:aws:ecs:us-east-2:123324351829:service/staging-ecs-cluster/staging-blue-service"
        name                               = "staging-blue-service"
        tags                               = {
            "Environment" = "staging"
            "ManagedBy"   = "terraform"
            "Name"        = "staging-blue-service"
            "Project"     = "tf-playground"
        }
      ~ task_definition                    = "arn:aws:ecs:us-east-2:123324351829:task-definition/staging-blue-task:16" -> (known after apply)
        # (16 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.ecs[0].aws_ecs_service.green will be updated in-place
  ~ resource "aws_ecs_service" "green" {
        id                                 = "arn:aws:ecs:us-east-2:123324351829:service/staging-ecs-cluster/staging-green-service"
        name                               = "staging-green-service"
        tags                               = {
            "Environment" = "staging"
            "ManagedBy"   = "terraform"
            "Name"        = "staging-green-service"
            "Project"     = "tf-playground"
        }
      ~ task_definition                    = "arn:aws:ecs:us-east-2:123324351829:task-definition/staging-green-task:14" -> (known after apply)
        # (16 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.ecs[0].aws_ecs_task_definition.blue must be replaced
-/+ resource "aws_ecs_task_definition" "blue" {
      ~ arn                      = "arn:aws:ecs:us-east-2:123324351829:task-definition/staging-blue-task:16" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-east-2:123324351829:task-definition/staging-blue-task" -> (known after apply)
      ~ container_definitions    = (sensitive value) # forces replacement
      ~ enable_fault_injection   = false -> (known after apply)
      ~ id                       = "staging-blue-task" -> (known after apply)
      ~ revision                 = 16 -> (known after apply)
        tags                     = {
            "Environment" = "staging"
            "ManagedBy"   = "terraform"
            "Name"        = "staging-blue-task"
            "Project"     = "tf-playground"
        }
        # (12 unchanged attributes hidden)
    }

  # module.ecs[0].aws_ecs_task_definition.green must be replaced
-/+ resource "aws_ecs_task_definition" "green" {
      ~ arn                      = "arn:aws:ecs:us-east-2:123324351829:task-definition/staging-green-task:14" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-east-2:123324351829:task-definition/staging-green-task" -> (known after apply)
      ~ container_definitions    = (sensitive value) # forces replacement
      ~ enable_fault_injection   = false -> (known after apply)
      ~ id                       = "staging-green-task" -> (known after apply)
      ~ revision                 = 14 -> (known after apply)
        tags                     = {
            "Environment" = "staging"
            "ManagedBy"   = "terraform"
            "Name"        = "staging-green-task"
            "Project"     = "tf-playground"
        }
        # (12 unchanged attributes hidden)
    }

Plan: 7 to add, 2 to change, 4 to destroy.

Changes to Outputs:
  ~ database_endpoint                = "staging-db.c38ukeqk0mqb.us-east-2.rds.amazonaws.com:3306" -> (known after apply)
  ~ database_port                    = 3306 -> (known after apply)
  ~ environment_summary              = {
      ~ database_endpoint = "staging-db.c38ukeqk0mqb.us-east-2.rds.amazonaws.com:3306" -> (known after apply)
        # (8 unchanged attributes hidden)
    }

  ```
  
  </details>